app/controllers/paintings_controller.rb

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @gallery = Gallery.find(params[:gallery_id])

SELECT  "galleries".* FROM "galleries" WHERE "galleries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "paintings" ("title", "artist", "gallery_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Santa eats Code"], ["artist", "Rudolf"], ["gallery_id", 1], ["created_at", 2017-01-12 22:50:55 UTC], ["updated_at", 2017-01-12 22:50:55 UTC]]
---
  def create
    @gallery = Gallery.find(params[:gallery_id])
    @painting = Painting.new(params_strong)
    @painting.gallery = @gallery
    if @painting.save